Repository: billy482/tape-benchmark
Catalog: locale/tape-benchmark.*.po
Languages: fr_fr

source: Bye !!!
fr_fr: Salut !!!

source: Warning: read less than expected, %zd instead of %zd
fr_fr: Attention: a lu moins que prévu, %zd au lieu de %zd

source: -R, --rewind-at-start : rewind tape before writing on tape, (default: no rewind at start)
fr_fr: -R, --rewind-at-start : rembobine la bande avant d'écrire sur la bande, (par défaut: pas de rembobinage)

source: -d, --device=DEV : use this device DEV instead of "%s"
fr_fr: -d, --device=DEV : utilise ce périphérique DEV au lieu de "%s"

source: -h, --help : show this and quit
fr_fr: -h, --help : affiche ceci et quit

source: -r, --no-rewind : no rewind tape between step (default: rewind between step)
fr_fr: -r, --no-rewind : ne rembobine pas entre chaque étape (par défault: rembobine entre chaque étape)

source: -s, --size=SIZE : size of file (default: %s)
fr_fr: -s, --size=TAILLE : taille du fichier (par défaut: %s)

source: 10 => 2^10 bytes (= 1K), 16 => 2^16 bytes (= 64K), 24 => 2^24 bytes (= 16M), and so on
fr_fr: 10 => 2^10 octets (= 1K), 16 => 2^16 octets (= 64K), 24 => 2^24 octets (= 16M), et ainsi de suite

source: 1B => 1 byte, 1K => 1024B, 1M => 1024K, 1G => 1024M, 1T => 1024G
fr_fr: 1B => 1 octet, 1K => 1024B, 1M => 1024K, 1G => 1024M, 1T => 1024G

source: based on git commit: %s
fr_fr: basé sur le commit git: %s

source: checksum of source code: %s
fr_fr: empreinte du code source: %s

source: %.*f GBytes
fr_fr: %.*f GOctets

source: %.*f KBytes
fr_fr: %.*f KOctets

source: %.*f MBytes
fr_fr: %.*f MOctets

source: %.*f TBytes
fr_fr: %.*f TOctets

source: , done
fr_fr: , fait

source: Another way to set the size is by specifying an integer which will be interpreted as a power of two.
fr_fr: Une autre façon de définir la taille est de spécifier celle-ci par un entier qui sera interprété comme une puissance de deux.

source: Constraint: min-buffer-size and max-buffer-size should be a power of two
fr_fr: Contrainte: min-buffer-size et max-buffer-size doivent être des puissances de deux

source: Device is no ready, so we wait until
fr_fr: Périphérique pas encore prêt, on attend qu'il le soit

source: Do you want to start benchmark ?
fr_fr: Voulez-vous commencer le teste ?

source: Error: max-buffer-size should be positive and a power of two
fr_fr: Erreur: max-buffer-size doit être un nombre positif et une puissance de deux

source: Error: min-buffer-size should be positive and a power of two
fr_fr: Erreur: min-buffer-size doit être un nombre positif et une puissance de deux

source: Error: size should be positive
fr_fr: Erreur: la taille doit être un nombre positif

source: Failed => %m
fr_fr: Échec => %m

source: Failed to open because %m
fr_fr: Échec de l'ouverture parce que %m

source: Finished, current speed %s
fr_fr: Fini, vitesse actuelle %s

source: Generate random data from "/dev/urandom"...
fr_fr: Génération de données aléatoires depuis "/dev/urandom"...

source: It seems that you cannot use a block size greater than %s
fr_fr: Il semble que vous ne pouvez pas utiliser une taille de bloque supérieur à %s

source: MTIOCGET failed => %m
fr_fr: Échec MTIOCGET => %m

source: Model: %s
fr_fr: Modèle: %s

source: Moving backward space 1 file...
fr_fr: Recule d'un fichier en arrière...

source: Nop failed => %m
fr_fr: Échec Nop => %m

source: Oops: an error occured => (%d) %m
fr_fr: Oops: une erreur s'est produite => (%d) %m

source: Oops: seem not to be a valid tape device
fr_fr: Oops: il semble que ce ne soit pas un lecteur de bande

source: Openning "%s"...
fr_fr: Ouverture "%s"...

source: Restarting, nb loop: %zd, block size: %s
fr_fr: Redémarrage, nb boucle: %zd, taille de bloque: %s

source: Rewinding tape...
fr_fr: Rembobinage de la bande...

source: SIZE can be specified with (BKGT)
fr_fr: TAILLE peut être spécifier avec (BKGT)

source: Serial number: %s
fr_fr: Numéro de série: %s

source: Starting, nb loop: %zd, block size: %s
fr_fr: Démarrage, nb boucle: %zd, taille de bloque: %s

source: Warning: block size is defined to %zd instead of %zd
fr_fr: Attention: taille de bloque est définie à %zd au lieu de %zd

source: Weof failed => %m
fr_fr: Échec Weof => %m

source: done
fr_fr: fait

source: failed!!!, because %m
fr_fr: échec!!!, parce que %m

source: fd: %d, buffer: %p, count: %zd
fr_fr: fd: %d, tampon: %p, total: %zd

source: loop: %lld, current speed %s, done: %.2f%%%n
fr_fr: boucle: %lld, vitesse actuelle %s, fait: %.2f%%%n
